---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.BackgroundColor
source: html/c9e6e5fa-2b1b-fb4d-3c86-21d18c3a50dd.htm
---
# Autodesk.Revit.ApplicationServices.Application.BackgroundColor Property

The background color to use for model views in this session.

## Syntax (C#)
```csharp
public Color BackgroundColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The backgroundColor argument does not represent a valid color.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null